[

  {
    "title": "Needfinding",
    "bigTitle": "Exploring Needfinding in Strava: A Deeper Look into Fitness Tracking",
    "description": "This project applies human-computer interaction (HCI) techniques to evaluate how effectively Strava meets the needs of diverse users. Through structured user interviews with athletes across different sports, I identified pain points in Strava’s design, particularly around non-endurance activities, indoor workouts, and users without smartwatches.",
    "link": "https://medium.com/@mdl4/exploring-needfinding-in-strava-a-deeper-look-into-fitness-tracking-ac67d7f89b28",
    "linkText": "Click here to see Medium Post",
    "image": "./images/strava_icon.png",
    "bigImage": "./images/strava.png"
  },

  {
    "title": "Redesign",
    "bigTitle": "Redesigning the Ephs Patient Portal",
    "description": "In this project our team set out to redesign Williams College’s Ephs Patient Portal, to improve usability and accessibility. We analyzed the existing portal’s weaknesses, identified key areas for improvement, and proposed design solutions to enhance user experience. Finally, using Figma we came up with a prototype that incorporated a modern, intuitive layout that aligns with Williams College’s branding. Our redesign aims to streamline the portal’s functionality, making it easier for students to access critical health resources efficiently.",
    "link": "https://medium.com/@ar30_72964/ds2-aaaba42836d7",
    "linkText": "Click here to see Medium Post",
    "image": "./images/redesign_icon.png",
    "bigImage": "./images/redesign.png"
  },

  {
    "title": "Interactivity",
    "bigTitle": "Designing Gesture-Based Interactions for 2048",
    "description": "In this project, we developed a gesture-controlled version of the puzzle game 2048 using MediaPipe and custom logic to map hand gestures to game commands. We implemented intuitive gesture mappings prioritizing simplicity, responsiveness, and error prevention. Through formative testing and iterative design, we created a system that balances natural user input with gameplay accuracy, demonstrating how gesture-based interaction can enhance accessibility in casual games.",
    "link": "https://medium.com/@rms7/ds3-designing-for-interactivity-in-2048-87c8d56be520",
    "linkText": "Click here to see Medium Post",
    "image": "./images/2048_icon.png",
    "bigImage": "./images/2048.png"
  },
  {
    "title": "Effectiveness",
    "bigTitle": "Redesigning a Bookstore Catalog",
    "description": "Our team was tasked with redesigning a basic online bookstore catalog website. The starter site had no clear visual structure, purpose, or navigation. This made it difficult for users to browse or find books efficiently. Our goal was to rethink the layout using Bootstrap and HCI principles to build something more discoverable, intuitive, and modern.",
    "link": "https://medium.com/@ndc2/ds3-redesigning-a-bookstore-catalog-54095c750b52",
    "linkText": "Click here to see Medium Post",
    "image": "./images/book_icon.png",
    "bigImage": "./images/book.png"
  },

  {
    "title": "Accessibility",
    "bigTitle": "Accessibility Audit of YouTube for People with Physical/Motor Disabilities",
    "description": "This project evaluates YouTube’s accessibility for users with physical or motor disabilities. It connects design theory (universal, inclusive, and value-sensitive design) to real user experiences, referencing accessibility standards like WCAG 2.1 and Section 508. It includes firsthand accounts from Reddit to identify specific barriers—like small skip buttons, timed prompts, and gesture-only controls—and provides clear design recommendations to make YouTube more usable and equitable.",
    "link": "https://medium.com/@mdl4/todo-595aba6560f4",
    "linkText": "Click here to see Medium Post",
    "image": "./images/youtube_icon.jpeg",
    "bigImage": "./images/youtube.png"
  },

  {
    "title": "Pulse",
    "bigTitle": "Pulse: A Chrome Extension for Productivity",
    "description": "Pulse is a Chrome extension that helps users stay focused by setting work session goals and gently reminding them when they get distracted. The team prioritized simplicity, user feedback, and accessibility. Key features include a clean timer setup interface, motivational pop-ups when users switch tabs, and alerts at the end of sessions. User testing shaped refinements like improved input formatting and softer sounds. Pulse emphasizes low-friction, goal-oriented productivity without blocking user behavior.",
    "link": "https://medium.com/@ndc2/pulse-a-chrome-extension-to-help-you-stay-on-task-d66606dd2929",
    "linkText": "Click here to see Medium Post",
    "image": "./images/timer_icon.png",
    "bigImage": "./images/timer.png"
  }

]


